# Tutorial 2 Pandas

In [2]:
import pandas as pd
import numpy as np

In [4]:
pd.read_csv('data.csv', delimiter=',').head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [5]:
zoo = pd.read_csv('data.csv', delimiter=',')

## Data Agrregation (Informasi Statistik)

#### Data Aggregation 1 : .count()

In [6]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [10]:
zoo[['animal']].count()

animal    22
dtype: int64

In [12]:
zoo.animal.count()

22

#### Data Aggregation 2 : .sum()

In [15]:
zoo[['water_need']].sum()

water_need    7650
dtype: int64

In [16]:
zoo.water_need.sum()

7650

In [17]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

#### Data Aggregation 3 dan 4 : .min() dan .max()

In [18]:
zoo.water_need.min()

80

In [19]:
zoo.water_need.max()

600

#### Data Aggregation 5 dan 6 : .mean() dan .median()

In [20]:
zoo.water_need.mean()

347.72727272727275

In [21]:
zoo.water_need.median()

325.0

## Pengelompokan pada Pandas

#### fitur .groupby di Pandas

In [23]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [31]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [37]:
zoo.groupby('animal').mean()[['water_need']]
# This returns a DataFrame object

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [38]:
zoo.groupby('animal').mean().water_need
# This returns a Series object.

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

## Test 1

#### Source terbanyak dalam data pandas_tutorial_read.csv

In [46]:
header = ['my_datetime', 'event', 'country', 'user_id', 'source','topic']
article_read = pd.read_csv('pandas_tutorial_read.csv', delimiter=';', names = header)

In [49]:
article_read.groupby('source').count()[['user_id']]

         user_id
source
AdWords      500
Reddit       949
SEO          346

## Test 2

#### untuk user dari country_2, manakah topik dan dari source mana topic terbanyak?

In [58]:
article_read[article_read.country == 'country_2'].groupby(['topic', 'source']).count()[['user_id']]

                       user_id
topic         source
Africa        AdWords        3
              Reddit        24
              SEO            7
Asia          AdWords       31
              Reddit       139
              SEO            9
Australia     AdWords        6
              Reddit        18
              SEO           10
Europe        AdWords       46
              Reddit        29
              SEO            4
North America AdWords       11
              Reddit        27
              SEO           42
South America AdWords       14
              Reddit        26
              SEO           16